{
    "Character Designer": "Mysterious Old Scholar - An elderly man named Chen Mingyi, a respected mysterious scholar on the island of Taiwan. In his youth, he traveled to various parts of the island in search of mysterious legends, gaining deep knowledge of the local mysteries and traditional culture. Chen Mingyi has been living in seclusion in an old mansion in a small town, studying ancient mythological legends alone and maintaining contact with many local residents. However, he harbors a secret: many years ago, he was involved in a mysterious group whose activities sparked a tragedy, leaving him feeling deeply guilty.\n\nYoung Female Painter - Named Cai Yuxuan, she is a creative and inspired painter. She excels in using the mythology and legends of Taiwan Island as the theme of her works, which are full of mystery and poetry. Cai Yuxuan used to play in the old mansion of the mysterious scholar Chen Mingyi in the small town when she was a child, and she was quite interested in his mysterious research. However, she carries a secret in her heart: she witnessed a mysterious event in her childhood, and this event has lingered in her mind, making her more persistent in her study of the mysterious scholar.\n\nYoung Lawyer - Surname Zheng, named Wenyu, he is an intelligent and resourceful lawyer skilled in investigating and uncovering the truth. Coming from a big city, his investigation into the case of the mysterious scholar in the small town is actually commissioned by the mysterious group. Wenyu Zheng harbors a secret: he once mistakenly got involved in the activities of a mysterious group in his youth and was threatened, which is why he is particularly focused on this case.\n\nCafé Owner - Surname Zhang, named Hongyi, is the owner of \"Cafe Delights\" and a student of the local mysterious scholar Chen Mingyi. He is a middle-aged man with meticulous thinking, good at observation and analysis. Zhang Hongyi has a secret: he used to be Chen Mingyi's assistant in his early years, but due to an accident, their mentor-student relationship fractured, leaving him burdened with guilt towards his mentor.\n\nThe background stories, motives, and secrets of each character are intertwined, injecting more mysteries and suspense into the entire story. The complex relationships among them will lead players to gradually unravel the hidden truths and conspiracies behind this murder case.",
    "Clue Generator": "Young Female Artist - Cai Yuxuan\nKey Clues:\n1. Mysterious Symbols on the Studio Wall: A series of ancient mysterious symbols were discovered on the wall of Cai Yuxuan's studio, seemingly connected to the mysterious books in Chen Mingyi's old mansion.\n2. Hidden Clues in Artworks: Cai Yuxuan's latest works contain hidden suggestive clues, hinting at a connection between past events and the mysterious group.\n\nMisleading Clues:\n1. Damaged Picture Frame in the Studio Corner: A damaged picture frame in the corner of the studio caught Cai Yuxuan's attention, but it did not contain any substantial clues.\n2. Mysterious Legends Mentioned by a Friend: Cai Yuxuan's friend mentioned some stories about mysterious legends, but these stories may just be misleading rumors.\n\nExplanation: Cai Yuxuan discovers clues related to the mysterious group through her own creations and observations, but may also encounter some misleading clues in the process, adding to the difficulty and intrigue of solving the mystery.",
    "Duration": "2-3 hours",
    "Player Instruction Writer": "Guidelines for Tsai Yuxuan's five rounds of role-playing:\n\nRound One: Tsai Yuxuan can showcase her artistic talent and curiosity about the case through self-introduction, while also revealing her interest in mysterious symbols and hidden clues to attract the attention and cooperation of other players.\n\nRound Two: In the second round, Tsai Yuxuan should actively participate in collecting clues provided by other players, pay attention to whether the information collected is related to her own artwork, and think about how to incorporate the clues into her creation.\n\nRound Three: During open discussions, Tsai Yuxuan can demonstrate her unique artistic vision and insight into mysterious events, share her creative ideas with other players, and guide the discussion in the right direction.\n\nRound Four: When collecting clues again, Tsai Yuxuan needs to carefully observe the words and actions of other players, consider if their clues align with her creative theme, and filter out useful information.\n\nRound Five: When voting for the culprit, Tsai Yuxuan can make a choice that aligns with her creative ideas based on her understanding of the case and the integration of clues, showcasing her unique artistic vision and reasoning abilities.",
    "Script Planner": "In a small ancient town on the island of Taiwan, there is a cafe named \"Cafe Delights\", with a cozy and quaint environment that attracts all kinds of people to come and taste delicious coffee and pastries. However, the peace and tranquility of this place were shattered by a murder.<image>The incident occurred on a rainy and gloomy night, where four key characters met inside the cafe. The first character is an elderly man, a famous local mythologist who knows the myths and legends of Taiwan like the back of his hand. The second character is a young female painter, renowned for her works based on mythological themes. The third character is a young lawyer from the big city who came to investigate a case involving the mythologist. The owner of \"Cafe Delights\" is the fourth character, a middle-aged man with a sharp mind, who is also a student of the local mythologist.<image>A fierce argument erupted inside the cafe, and the old mythologist was found dead in a corner. The events surrounding the case are full of mysteries, with each character having their own secrets and motives. Was the female painter jealous of the mysterious knowledge possessed by the old mythologist? Does the young lawyer have hidden motives? Is the owner concealing his connection to the old mythologist? Who is the real culprit? What secrets and conspiracies lie behind this murder case? Through this story, players will be drawn into a complex plot full of Taiwanese myths and cultural history, challenging their wits and courage to unravel the mystery.",
    "Script Writer": "Mysterious Scholar - 4 days ago\nDate: Monday\nKey Event: Chen Mingyi was reading ancient books in the old mansion and discovered a long-lost mysterious book, which contained the history of activities of a mysterious group.\nThoughts: Chen Mingyi felt a surge of emotions in his heart, deeply regretting his past actions, while also feeling excited about the discovery of the book.\nPlan: He decided to study the content of the book and search for clues to unravel the knots in his heart for many years.\nInteraction: Discussed the content of the book with Hongyi, hoping to find answers.\n\nYoung Female Artist - 4 days ago\nDate: Monday\nKey Event: Cai Yuxuan was creating a new artwork in her studio, inspired by the mysterious legends from Chen Mingyi's old mansion.\nThoughts: She was curious and puzzled about the mysterious scholar and the events she witnessed in her childhood, hoping to express her inner turmoil through her artwork.\nPlan: Planning to visit Chen Mingyi to learn more about the stories behind the mysterious legends.\nInteraction: Shared creative inspiration with friends, seeking advice and support.\n\nYoung Lawyer - 4 days ago\nDate: Monday\nKey Event: Wen Yan discovered some clues about mysterious groups while investigating the case of the mysterious scholar, starting to suspect the truth behind the case.\nThoughts: He felt puzzled and uneasy, being vigilant and curious about the activities of the mysterious group.\nPlan: Decided to continue investigating deeply, looking for more evidence to uncover the truth of the case.\nInteraction: Communicated information with the assistant of the mysterious scholar, attempting to obtain more clues.\n\nCafé Owner - 4 days ago\nDate: Monday\nKey Event: Hongyi calmly contemplated past events in the café, recalling the various aspects of his mentor-disciple relationship with Chen Mingyi.\nThoughts: He felt conflicted internally, the guilt towards his master and the curiosity about the case intertwined, making him unable to let go.\nPlan: Decided to have a face-to-face conversation with Chen Mingyi, sharing his inner turmoil and guilt.\nInteraction: Discussed the progress of the case with lawyer Zheng Wenyan, trying to learn more about the case from the lawyer.",
    "Title": "The Mystery of Mystical Symbols: An Artistic Creation and Journey of Deduction",
    "characters": [
        {
            "act_1": "Lin Yuan is an elderly man full of wisdom and mystery. He displays a calm demeanor in the coffee shop but is filled with anxiety and worry inside. On this evening, he discovers a dropped necklace, sparking his curiosity and contemplation about the case. Deeply valuing Taiwanese culture, Lin Yuan hopes to protect this heritage through his own efforts and is unwilling to see it harmed. In his relationship with other characters, he has a teacher-student relationship with Lin Ya-Wen, an interaction that makes him pay closer attention to the revelation of the truth in dealing with the case. Lin Yuan's inner secret is a mysterious experience from his youth, which still remains a painful memory for him. Through his interactions with other characters, Lin Yuan shows his love and protection for Taiwanese culture, while demonstrating his calm analysis and firm determination on the path to uncovering the truth.",
            "act_2": "In this scene, Lin Yuan faces the complexity of the case and the emergence of new clues, causing him to feel uneasy and conflicted. Upon discovering the victim's lost necklace, he starts to suspect that he may have gotten in deeper danger. Lin Yuan struggles internally, contemplating whether to reveal the clues he knows or to remain silent to protect himself and Taiwanese culture. The conflicts with other characters intensify, particularly the cooperation or confrontation with the young man, Chen Yuxuan. Lin Yuan's decision will determine the course of the entire plot - whether to maintain the status quo or uncover deeper secrets. At this crucial moment, Lin Yuan's psychological changes become crucial; will he choose to expose his vulnerabilities or continue to disguise himself as calm and rational? This scene will be a turning point in Lin Yuan's character script, showcasing his complex inner world and the critical decisions that influence the overall story.",
            "act_3": "In this scene, the young man Chen Yuxuan discovers a crucial clue in a coffee shop, pointing to a mistake he made during his past archaeological excavations, which fills him with fear and guilt. He begins to question whether he should expose this secret, and faced with his past errors and feelings of guilt, his emotions reach a climax. In his interactions with other characters, Chen Yuxuan's anger, regret, and panic intertwine as he desperately seeks a solution to the problem, but internal conflicts leave him trapped in a heavy psychological dilemma. At this critical moment, the young man is faced with a life-or-death decision—should he continue to conceal his past mistakes, or bravely reveal the whole truth? His emotional turmoil is intense, conflicts escalate with other characters, and at this turning point, Chen Yuxuan's choice will directly impact the direction of the entire plot, revealing his true character and the complex emotions hidden within him.",
            "act_4": "At this critical moment, the young man Chen Yuxuan faces the scrutiny of judgment and the pressure of making a significant decision. His emotions reach a climax as he is deeply immersed in an internal struggle: should he confess to the crime he once committed, accept the deserved punishment, or continue to insist on his innocence and evade the shackles of responsibility? In this moment that will determine his future destiny, Chen Yuxuan's heart is filled with complex emotions of regret, anger, relief, and fear. He realizes his past mistakes but also fears losing everything if he admits his guilt. Faced with the final choice, Chen Yuxuan must decide whether to bravely confront his faults or continue to evade and be haunted by the burden of past transgressions and fear. His decision will determine the ultimate destination of his inner world, whether he can achieve self-redemption, or continue to be enveloped by the burden of past transgressions. This decision will play a crucial role in the outcome of the entire script, revealing Chen Yuxuan's true inner world and growth journey.",
            "name": "Young man"
        },
        {
            "act_1": "On this evening, when the mysterious old man Lin Yuan entered \"Cafe Delights\" coffee shop, his expression appeared calm and serene, as if he were a wise sage who knew everything. However, the anxiety and unrest in his heart were hard to hide. Lin Yuan's eyes shimmered with love and protection for Taiwanese culture, as he deeply understood that this precious heritage needed to be safeguarded. Despite appearing calm and rational, the anxiety and worries in his heart lingered constantly.\n\nLin Yuan discovered a dropped necklace, which led him to speculate that it could be a crucial clue about the victim. While conversing with three other key characters, he showcased a profound understanding of Taiwanese culture, sharing a mentor-student bond with the young woman Lin Ya Wen and discussing the mysteries of history with the young man Chen Yu Xuan.\n\nThe experiences from the past related to Taiwanese myths and legends still remain a secret within Lin Yuan, driving him to be more determined in protecting cultural heritage. He strives to protect Taiwan's traditional culture and hopes to uphold justice by revealing the truth about the case.\n\nLin Yuan's character story is full of emotional conflicts and psychological struggles, with his outward calmness sharply contrasting his inner anxiety. His complex interactions with other characters demonstrate his intelligence, insight, and steadfast beliefs. In this murder case, Lin Yuan will play a crucial role, leading the development of the entire story and uncovering more little-known truths about the history of Taiwanese culture.",
            "act_2": "In this scene, the mysterious traveler gradually faces escalating conflicts, and the complexity of the case begins to emerge. The introduction of new clues, particularly key information related to the case, drives the plot towards a climax. Characters start to realize that their previous judgments may have been wrong, and that their actions may have deeper connections to the case. Describing the emotional fluctuations of the characters at this stage, whether they choose to actively reveal the information they know, or continue to remain silent. Throughout this process, the conflicts between the mysterious traveler and other characters intensify, with potential for cooperation or confrontation. The character's decisions will greatly affect the direction of the plot - whether to maintain the status quo or to uncover hidden secrets. The psychological changes of the characters at this point are crucial - whether to expose vulnerability or to continue pretending to be calm and rational. The mysterious traveler Lin Yuan shows inner conflicts and struggles when faced with new challenges. He begins to realize the complexity of the case and the potential dangers, while also feeling a great responsibility to protect Taiwanese culture. Upon discovering new crucial clues, Lin Yuan is faced with the choice of whether to disclose the information he knows or to remain silent and wait for a better opportunity. The conflicts between him and other characters intensify, especially the complicated emotional entanglement with the young woman Lin Yawen. Lin Yuan's psychological fluctuations and choices will directly impact the development of the entire plot. His decision will determine whether to continue seeking the truth or to choose to conceal his secrets, revealing his true inner self.",
            "act_3": "On the fourth evening, Lin Yuan was alone in a corner of the café, contemplating the various clues and mysteries of the case. Suddenly, a familiar figure walked into the café - it was his former student, Lin Ya-Wen. Lin Ya-Wen anxiously handed Lin Yuan a document, which detailed the victim’s involvement in a historical research project related to myths and legends. A realization struck Lin Yuan, realizing that this might be the key clue to unraveling the mystery. Gratefully, he looked at Lin Ya-Wen, and a sense of unspoken understanding between teacher and student re-emerged.\n\nLin Yuan decided to share this document with Chen Yu-Xuan, hoping to uncover the truth behind the murder case from a historical perspective. However, at that moment, a mysterious tourist suddenly appeared before them, looking at Lin Yuan with a grave expression. Lin Yuan felt a hint of unease, as if the stranger could see through his inner secrets. In this tense atmosphere, Lin Yuan faced a significant psychological dilemma - whether to continue hiding his past mistakes or bravely reveal all the truths. His emotions of anger, regret, and panic intertwined, causing intense turmoil within him.\n\nUltimately, Lin Yuan decided to courageously confront his past, expose his secrets, and reveal the truth behind the case. He bravely stepped forward, honestly disclosing everything to everyone present. This transformation was a crucial scene in Lin Yuan's character script, as his courage and sincerity influenced the direction of the entire story and deeply impacted other characters. This scene depicted Lin Yuan's inner struggle and growth, adding suspense and emotional tension to the entire script.",
            "act_4": "In the final scene of the trial, the mysterious old man Lin Yuan is faced with a crucial decision: whether to admit his guilt in the mysterious events of his youth or to continue to uphold his mission of protecting Taiwanese culture by exposing the truth behind the murder case at all costs. A tumultuous struggle and conflict brew within him, as regret and responsibility intertwine, and fear and determination coexist. In the end, Lin Yuan decides to confront his past mistakes, bravely confess his crimes, accept judgment and punishment, taking responsibility for his actions and contributing his part to the continuation and protection of Taiwanese culture. At that moment, he finds a sense of liberation and redemption within himself. Though pain and regret linger, he chooses to face his past and make a courageous decision for the future. This ending showcases Lin Yuan's growth and inner transformation, allowing players to deeply feel his complex emotions and ultimate resolve.",
            "name": "Mysterious tourist"
        },
        {
            "act_1": "On a rainy night, the old occultist Chen Mingyi was alone in his old mansion, poring over ancient texts when he stumbled upon a long-lost mysterious book detailing the history of a secretive group's activities. His heart was filled with tumultuous emotions as he deeply regretted his past involvement with the mysterious group, yet also felt excited about the discovery of the book. Chen Mingyi decided to study the contents of the book, seeking clues to unravel the long-held secrets. In discussions with his student Zhang Hongyi, he attempted to seek answers while also exploring the past.\n\nMeanwhile, the young female painter Cai Yuxuan was creating new artwork in her studio, drawing inspiration from the mysterious legends surrounding Chen Mingyi's old mansion. Curious and perplexed about the occultist and events from her childhood, she hoped to express her inner turmoil through her paintings. Cai Yuxuan planned to visit Chen Mingyi to learn more about the stories behind the mysteries. Sharing her creative inspirations with friends, she sought advice and support.\n\nAt the same time, the young lawyer Zheng Wenyang, while investigating the occultist's case, uncovered some clues about the mysterious group, leading him to question the truth behind the case. Feeling doubtful and uneasy, he was vigilant and curious about the group's activities. He decided to continue his in-depth investigation, searching for more evidence to uncover the truth. In exchanging information with the occultist's assistant, he attempted to obtain more clues.\n\nSimultaneously, the café owner Zhang Hongyi contemplated past events in his café, reminiscing about his various experiences with his mentor Chen Mingyi. In a conflicted state of mind, he felt guilty towards his mentor and curious about the case, leaving him unable to find peace. He decided to have a face-to-face conversation with Chen Mingyi to confide his inner turmoil and guilt. During discussions with the lawyer Zheng Wenyang regarding progress in the case, he tried to glean more information about the situation from the lawyer. Throughout the story, each character's actions and thoughts intertwine, adding more suspense and mysteries to the story's development.",
            "act_2": "In this scene, the old occultist - a man named Chen Mingyi, discovers a long-lost mysterious book in his old mansion, unveiling the history of the mysterious group's activities. He experiences tumultuous emotions, feeling both guilty and remorseful for his past actions, yet excited by the discovery of the book. Chen Mingyi decides to study the contents of the book, seeking clues to unravel his inner conflicts, while discussing the book's contents with his student Hongyi, hoping to find answers. Throughout this process, his emotional fluctuations become apparent, his internal struggles and conflicts intensifying, as he faces the decision of whether to expose past secrets, choosing between honesty about his faults or continued silence. This decision will greatly influence the direction of the plot and change the attitudes of other characters towards him. Chen Mingyi's psychological changes will be crucial at this stage, whether he will show his vulnerable side or continue to maintain a facade of calm rationality, will determine his fate and development in the story.",
            "act_3": "In this scene, the old mystic Chen Mingyi discovered a long-lost mysterious book, which contains the history of activities of a mysterious group. His emotions were tumultuous, feeling deep regret and guilt, but also filled with excitement at the discovery of the book. Chen Mingyi decided to study the contents of the book to find clues to unravel his inner conflict. Through discussions with his student Hongyi, he gradually unraveled secrets from the past, facing his fears and sense of guilt deep within. When emotions reach a climax, Chen Mingyi may exhibit various feelings such as anger, regret, and panic. He is facing a significant psychological decision: whether to continue to conceal his wrongdoing or bravely reveal all the truths. His transformation in conflicts with other characters, especially intensifying conflicts with the student Hongyi, will be crucial. He will be confronted with the choice of repentance or continuing in ignorance, with emotional fluctuations fully displayed. Especially during key confrontations, the characters' extreme reactions will determine the turning point of the plot.",
            "act_4": "The enigmatic historian Chen Mingyi stands at the crossroads of judgment, turmoil in his heart. He is deeply torn between guilt and excitement, feeling remorse for past sins on one hand and thrilled to have discovered a lost mystical manuscript on the other. Faced with the ultimate decision, Chen Mingyi must choose to acknowledge his wrongdoing, face punishment, or continue to insist on innocence and evade responsibility. The internal struggle and conflicting emotions reach a climax, with guilt, excitement, and fear intertwining. Finally, Chen Mingyi decides to bravely admit his faults, accept judgment, in hopes of finding redemption and peace within himself. This decision will profoundly impact his destiny, revealing the ultimate destination of his inner world.",
            "name": "Mysterious Elder - the elderly man's name is Chen Mingyi."
        },
        {
            "act_1": "Lin Yuan, a retired professor of folklore, opened a café in a small town on the island of Taiwan. He has a deep research and passion for Taiwanese culture, but harbors a shadow of a mysterious past. When a murder occurs, Lin Yuan outwardly remains calm but is filled with anxiety and unease inside, worried about the harm to Taiwanese culture. He discovers a necklace left behind by the victim and historical research clues related to the case, deepening his interest in the case and desire to investigate.\n\nLin Yuan has complex relationships with other key characters, particularly with the young beauty Lin Yawen. He shows a spirit of cooperation and insight in his interactions with the young man Chen Yuxuan and a mysterious tourist. Over the course of four days, Lin Yuan experiences internal struggles and emotional fluctuations but remains dedicated to his love and protection of Taiwanese culture, hoping to uncover the truth of the case through his efforts and uphold justice. In the final decision, Lin Yuan will demonstrate his puzzle-solving skills and decisiveness, influencing the direction of the entire story.",
            "act_2": "In this scene, Lin Yuan gradually faces more serious conflicts, and the complexity of the case begins to manifest. The emergence of new clues, especially key intelligence related to the case, drives the plot towards its climax. Characters begin to realize that their previous judgment may have been wrong, and that their actions may have deeper connections to the case. Lin Yuan's emotional turmoil intensifies as more clues are revealed, prompting him to decide whether to voluntarily disclose what he knows or to remain silent. In conflicts with other characters, Lin Yuan exhibits inner struggle and determination, as he may choose to cooperate or to resist. Lin Yuan's decision will have a significant impact on the plot - will he maintain the status quo or reveal hidden secrets? At this moment, Lin Yuan's psychological changes will be crucial - he may expose his vulnerability or continue to disguise himself as calm and rational in order to achieve his goals.",
            "act_3": "In this scene, Lin Yuan gradually uncovers the truth of the case, facing the fear and guilt deep inside. His emotions reach a climax, with anger, regret, and panic interwoven. He faces a psychological dilemma - whether to continue hiding the wrongdoing or to reveal the truth? During the revelation process, conflicts arise with other characters, especially escalating conflicts with Lin Yawen. The key lies in the character's transformation - repentance or obstinacy? The fluctuation of emotions is fully displayed, reaching the limit during crucial confrontations.",
            "act_4": "Lin Yuan stood before the judgment, his heart torn with conflict. He was fully aware of his pursuit of justice and his mission to protect culture, but at the same time, he realized that he might be misunderstood due to his past secrets. In front of everyone's eyes, Lin Yuan finally made the difficult choice - he chose to confess to the mysterious events he had experienced in the past, revealing all the secrets deep within his heart, including the experiences related to the Taiwanese mythological legends. He hoped that by facing his past with honesty, accepting his faults, he could find redemption and liberation within himself. Lin Yuan's eyes flickered with regret and anger, but also with a hint of relief and comfort. His choice would profoundly impact his fate, but it also allowed him to rediscover inner peace and self-awareness. In this moment, Lin Yuan's inner world found its final resting place, and he embraced a new beginning.",
            "name": "Lin Yuan"
        },
        {
            "act_1": "On Monday night, Cai Yuxuan sat alone in her studio, the light reflecting mysterious symbols on the walls of the room. She held a paintbrush in her hand, but it was paused mid-air, her eyes gazing into the distance with a distant look. Images of the mysterious incident she witnessed as a child at the Chen Mingyi mansion flashed through her mind, stirring up unease and confusion once again in her heart.\n\nThough Cai Yuxuan appeared focused and calm on the surface, anxiety and fear were spreading continuously within her. Her artworks concealed suggestive clues, hinting at a connection between past events and a mysterious group, driving her to investigate the truth more persistently. She yearned to find clues to unravel the knots in her heart, yet feared that facing the truth would hurt her inner being once more.\n\nMeanwhile, interactions with other key characters further complicated Cai Yuxuan's emotions. In her conversation with the lawyer Zheng Wenyen, she glimpsed hints about the mysterious group, reinforcing her own speculations. In her exchanges with her boss, Zhang Hongyi, she sensed the nuanced relationship between mentor and disciple, sparking more questions about the master's identity and past.\n\nCai Yuxuan's goal is to seek the truth and untangle the knots in her heart, but her inner secrets and emotional conflicts make her decisions more complex. She needs to confront past fears and uncertainties while maintaining a calm, analytical, and investigative attitude. In this story filled with mystery and puzzles, Cai Yuxuan's role will play a crucial part, propelling the development of the entire plot.",
            "act_2": "In this scene, the young female painter Cai Yuxuan discovered a mysterious symbol while creating a new piece in her studio, which resembled the symbols she had seen earlier at the Chen Mingyi's old mansion. This discovery left her conflicted, as she was filled with both curiosity and excitement, wanting to explore the meaning behind the symbol further, but also feeling fear and confusion, worried that her discovery might unearth deeper secrets. Cai Yuxuan began to doubt whether she had unintentionally uncovered a past that should not have been touched, intensifying her internal conflict and anxiety. Through interactions with other characters, she gradually realizes that her actions could influence the direction of the entire case, but she also fears becoming a target of criticism. In this situation, Cai Yuxuan faces a choice: whether to actively reveal her discovery or remain silent to avoid being dragged into deeper troubles. Her inner struggle and decision-making will play a crucial role in this scene, injecting more tension and suspense into the plot's climax.",
            "act_3": "In this scene, the young female artist Tsai Yuxuan discovered a long-lost mysterious book in the old mansion of Chen Mingyi, which recorded the history of activities of a secretive group, deepening her curiosity and puzzlement about past events. While creating a new artwork in her studio, her thoughts were consumed by these discoveries, causing emotional turbulence within her. Tsai Yuxuan felt deep regret and turmoil over her encounters with the mystic and childhood witnessed events, and this complex interweaving of emotions brought her to a climax of emotions. In her interactions with other characters, she may display various emotional states such as anger, regret, and panic, especially in conversations with the lawyer Zheng Wenyi and the boss Zhang Hongyi.\n\nAt this crucial moment of psychological decision-making, Tsai Yuxuan faces a significant choice: whether to continue concealing the events she witnessed in her childhood or bravely reveal all the truths. Her inner struggle and emotional fluctuations will be fully displayed, especially in conflicts and confrontations with other characters. She may show remorse or stubbornness in her final decision, which will greatly impact the direction of the entire plot. The character development and emotional changes of Tsai Yuxuan will reach a climax in this scene, laying the foundation for the turning point of the entire story.",
            "act_4": "At the crucial moment of the trial, the young female painter Cai Yuxuan stood in court, facing the scrutiny and questioning of everyone. She was caught in a deep struggle within herself, torn between regret and fear of her past secrets and crimes on one hand, and the desire and hope for the innocence she had always maintained on the other. Under the judge's interrogation, Cai Yuxuan finally made a crucial decision: she chose to admit her crimes and accept the rightful punishment. This move shocked everyone, including herself, but she knew it was the only right decision, the only way to take responsibility for her past mistakes.\n\nWith her confession, Cai Yuxuan felt a kind of liberation in her heart. She felt sadness and regret, but also a sense of relief and ease. She was finally no longer haunted by the burden of past guilt and fear, able to face her inner self and start her life anew. While this ending was filled with pain and regret, it also showcased Cai Yuxuan's courage and determination, as well as her pursuit of self-redemption. This choice not only affected her fate but also made other characters and players reassess the truth and complexity of the entire case.",
            "name": "Young female painter - named Cai Yuxuan"
        },
        {
            "act_1": "In this ancient temple case, Ye Ming, as a devout Taoist, carries the responsibility of upholding tradition and the protection of the divine dragon. Deep within his heart lies a belief in and fear of the power of the divine dragon. Four days before the case occurred, his mind was gradually enveloped by unease and doubt. Ye Ming felt a sinister aura approaching every day, causing inner anxiety and unrest, yet he had to maintain a calm and sacred demeanor. While interacting with the villagers, he exuded a sense of devotion and divine protection, but deep inside, he sensed an impending storm and started praying for the safety of the temple.\n\nKey clues for Ye Ming include an ancient prophecy he learned during his practice in Tibet, and a premonition of the sinister aura approaching the Green Dragon Temple. These clues will guide players to delve deeper into the connection between Ye Ming and the case, challenging their reasoning and puzzle-solving abilities.\n\nIn interactions with Lin Zhengyi and Chen Wanru, Ye Ming will demonstrate his treasuring of friendship and trust, while also facing conflicts and confrontations with them. His decisions and actions will directly influence the course of the entire case, while also revealing his inner secrets and true motivations.\n\nThrough Ye Ming's role-playing in the five rounds of discussions, players will deeply experience his inner conflicts and struggles, as well as his unwavering commitment to the protection of the divine dragon and traditional beliefs. Ye Ming's character will inject more dramatic tension into the whole story, guiding players to explore the deep secrets and mysteries behind the temple case. Wishing the game success, we look forward to players immersing themselves fully in this immersive murder mystery game, unraveling the truth behind the Green Dragon Temple case together!",
            "act_2": "In this scene, Ye Ming felt a looming sense of danger inside the Green Dragon Temple, causing him to feel anxious and uneasy. He began to doubt whether his previous judgments were correct and whether there was a deeper connection to the case. The emergence of new clues made him realize that he held crucial information that could reveal the connection between an ancient prophecy within the temple and the case. Ye Ming faced a choice – whether to actively disclose the information he knew or to remain silent to maintain the status quo. Throughout this process, Ye Ming's conflict with Lin Zhengyi escalated, and the decision between friendship and the truth left him mentally exhausted. His decision would greatly impact the direction of the story – whether to uphold his beliefs or uncover hidden secrets. Ye Ming's inner struggles and conflicting emotions will be crucial, as whether he chooses to reveal his vulnerabilities or continue to disguise himself as calm and rational will determine his fate and the development of the case.",
            "act_3": "In this scene, Ye Ming faces the gradual revelation of the truth behind the Qinglong Temple case, with deep-seated fear and guilt rising within him. His emotions reach a climax, as anger, regret, and panic intertwine, causing his mood to fluctuate intensely. Ye Ming is confronted with a significant psychological decision: whether to continue hiding his faults or bravely expose all the truths. Throughout the revealing process, the conflicts between him, Lin Zhengyi, and Chen Wanru escalate further. The inner transformation of Ye Ming is crucial as he contemplates whether to repent or persist in his stubbornness. During the crucial confrontation, the emotional turmoil of Ye Ming will be fully displayed.\n\nReflecting on the prophecy he learned during his practice in Tibet, Ye Ming realizes its possible connection to the case. He starts to unveil the link between this ancient prophecy and the case. When faced with the ominous premonition before the incident, Ye Ming's inner turmoil leads to anxiety, but he remains steadfast in his faith, praying for the protection of the divine dragon. As the truth gradually unfolds, the inner struggles and conflicts of Ye Ming will compel him towards bravely facing his faults and saving his faith, ultimately influencing the course and outcome of the entire case.",
            "act_4": "Ye Ming stood under the statue of the Divine Dragon in front of the temple, as the moment of judgment finally arrived. His inner turmoil was like a storm, with a whirlwind of complex emotions swirling in his mind. Deeply inhaling the incense-filled air in the temple, Ye Ming's eyes flickered with conflict and struggle. On one hand, he wanted to uphold the dignity and protection of the Divine Dragon, defending the traditions and beliefs of the Azure Dragon Temple; on the other hand, he knew full well the ancient prophecy he carried and the heavy secret he had learned in Tibet. Sweat soaked Ye Ming's clothes, his hands trembling slightly, as if bearing the weight of the world.\n\nThe voice of the arbiter echoed through the temple, forcing Ye Ming to make a critical choice. He could choose to stand by his beliefs and innocence, continue to defend the Divine Dragon, but this might mean concealing the truth and evading responsibility; alternatively, he could choose to honestly admit everything he knew, including the ancient prophecy, face judgment, but that would mean losing everything, including the chance to protect the villagers.\n\nYe Ming's inner struggle reached its peak, he closed his eyes, trying to calm the storm within. Finally, he opened his eyes, gazed at the arbiter, and confidently walked towards the side of truth. He spoke slowly, his voice carried away by the wind, \"I choose...\"\n\nAt this moment, Ye Ming's choice would completely change his destiny. Regardless of which path he ultimately chose, he would confront the depths of his own heart, undergoing scrutiny and making decisions about the past and the future. This was the most difficult moment of his life, as well as the crucial turning point towards redemption and freedom.",
            "name": "Ye Ming"
        },
        {
            "act_1": "Ye Ming bathed in the morning sun at the Green Dragon Temple, feeling the blessing of the divine dragon. He thought to himself that the temple had been thriving recently, with strong faith from the villagers, but he also felt a hint of unease, as if a storm was brewing. He planned to strengthen his connection with the divine dragon during this time to safeguard the safety of the villagers. The next day, Ye Ming learned that Lin Zhengyi had been frequenting the temple lately, which left him puzzled, but he did not delve deeper into it. Through conversations with the villagers about faith, he felt the sincerity and devoutness of the villagers toward the divine dragon's blessing, which further solidified his sense of duty. On the third day, a mysterious man arrived at the temple, requesting to see Ye Ming, claiming to have important information about the Green Dragon Temple. Despite feeling turbulent inside, Ye Ming remained calm and received the man, trying to understand his true intentions. He decided to secretly observe the man to prevent any danger to the temple. On the fourth day, Ye Ming was suddenly awakened in the night by an ominous premonition, feeling a malevolent presence gradually approaching the Green Dragon Temple. Anxious and uneasy, he began to pray for the protection of the divine dragon, preparing to face the imminent challenge. In conclusion, as the caretaker of the Green Dragon Temple, Ye Ming bears the responsibility of upholding tradition and culture. Deep within him lies a belief in and fear of the power of the divine dragon. In the days leading up to the incident, his heart was gradually overshadowed by unease and doubt, while he also worked hard to ensure the safety of the temple and the protection of the divine dragon.",
            "act_2": "Through the five-day inner journey of Ye Ming, Lin Zhenyi, and Chen Wanru in the case of the Green Dragon Temple, players will witness the emotional fluctuations, inner struggles, and decision-making processes of each character when faced with challenges. Ye Ming, as a devout believer, is led by his inner faith and fear, guiding him through the firmness and anxiety under the protection of the divine dragon. Lin Zhenyi, as a scholar who values traditional culture and friendship, is caught in a dilemma due to his inner conflicts and desire for exploration. Chen Wanru, as a young detective pursuing justice, is driven by her inner desire for truth and the struggle of her past experiences to bravely face the complexity of the case.\n\nIn this case full of mysteries and crises, the emotional fluctuations and decisions of each character will gradually unfold through five rounds of discussion, driving the plot towards a climax. They will face choices, uncover hidden secrets, or continue to remain silent, while the relationships and interactions between the characters will also lead to intense conflicts and cooperation. Players will feel the tension and driving force of the plot through the psychological changes and decisions of the characters, ultimately witnessing how their decisions impact the direction of the whole story. Wishing the game smooth sailing and a colorful and exciting plot!",
            "act_3": "In this scene, Chen Wanru faces the pressure and challenges as the truth of the case gradually comes to light. Inside the Green Dragon Temple, she examines the body of the victim man, with a mix of complex emotions flooding her mind: anger, regret, fear, and various feelings intertwined. She fully understands that revealing the truth may involve more conflicts and secrets, but she firmly believes in the importance of justice and fairness.\n\nAs the investigation deepens, Chen Wanru uncovers some key clues that reveal a mysterious connection between the victim man and the dragon statue inside the temple. These discoveries make her realize that the case is far more complex than it appears on the surface, with every corner of the temple seemingly hiding unknown secrets. At this moment, she faces a significant psychological dilemma: whether to continue pursuing the truth or choose to conceal what she knows, in order to maintain the peace and safety of the temple and the villagers.\n\nIn the confrontation with Ye Ming and Lin Zhengyi, Chen Wanru's emotional turmoil reaches its peak. She realizes that everyone carries a heavy burden of the past and responsibilities, and this case will completely change the fate of everyone involved. Confronted with the mysteries and puzzles inside the temple, Chen Wanru ultimately makes a brave decision—she chooses to reveal all the truths, regardless of the consequences.\n\nThis scene depicts Chen Wanru's inner struggle and growth, as she faces fear and hesitation, ultimately choosing justice and truth. Her decision not only impacts the direction of the case but also allows each character to find a new way out in this complex puzzle. The case of the Green Dragon Temple will take an unexpected turn due to Chen Wanru's courage and persistence, making the story even more gripping and intense.",
            "act_4": "At the crucial moment of the trial, Chen Wanru stood in the courtroom, facing the scrutiny and questioning of everyone. Her heart was in turmoil, recalling the various experiences and discoveries in investigating the case, her thoughts chaotic. On one hand, she longed to reveal the truth, to bring justice to the victim, and to uncover the secrets hidden within the temple. On the other hand, the secrets in her heart and the connections to the case made her hesitant and fearful that her past would be exposed.\n\nWith a firm yet bewildered gaze, Chen Wanru ultimately made a choice—under the judge's questioning, she chose to confess the special relationship between herself and the victimized man, revealing the secrets buried deep in her heart. She embraced her past, acknowledged its complexity, and let go of the burden in her heart. This decision brought her an inexplicable sense of liberation and ease, while also giving her the courage and determination to face the future.\n\nAt the end of the trial, tears glistened in Chen Wanru's eyes, but they were tears of acceptance and solace. She might face punishment, yet she chose to confront her past, accept the shadows in her heart, and this courage and honesty granted her inner redemption. As the sound of the trial bell rang, Chen Wanru turned and left the courtroom with a smile on her face, welcoming a new starting point and future.",
            "name": "Chen Wanru"
        },
        {
            "act_1": "In an ancient village on the island of Taiwan, Shi Mingci is a highly respected monk, beloved by his followers. However, he harbors a little-known past as a martial arts master, choosing to become a monk to escape the conflicts of his past. In a mysterious murder case, Shi Mingci feels lonely and confused, burdened by guilt over his secret past. He plans to uncover his past, hoping for understanding and forgiveness while realizing that there may be a larger conspiracy behind the sacred artifact. The connections between Shi Mingci, the young scholar Shen Zimo, and the out-of-town merchant Liu Yun gradually reveal more mysteries, putting him in a dangerous situation. Through contemplating the case and gathering clues, Shi Mingci shows a desire for the truth and hope in his heart. His inner conflicts and emotional fluctuations will drive the development of the entire story, revealing a shocking truth.",
            "act_2": "In this scene, Shi Mingci gradually faces escalating conflicts and the complexity of the case begins to emerge. The emergence of new clues, especially key intelligence related to the case, drives the plot to a climax. Shi Mingci begins to realize that his previous judgments may have been wrong, and that his own actions may have deeper connections to the case. He feels more lonely, confused, and guilty, and the pressure of keeping his past martial arts identity secret feels even heavier. In the process, Shi Mingci discusses the secret of the divine artifact with Shen Zimo, trying to find more clues that will help uncover the truth. At the same time, he also starts to doubt the true intentions of Liu Yun, planning to secretly investigate Liu Yun's background to prevent any unexpected events. Shi Mingci's decision will greatly impact the direction of the plot - whether to maintain the status quo or to reveal hidden secrets. His inner struggle and decision at this moment are crucial; whether to expose vulnerability or to continue pretending to be calm and rational on the outside. This scene will set deeper foreshadowing for the development of the entire plot.",
            "act_3": "On the evening of the fourth day, Shi Mingci stood alone in front of the shrine in the temple, holding a poisoned prayer bead in his hand, feeling conflicting emotions reaching a peak within him. He deeply breathed in the stillness of the temple, reflecting on the past. Shi Mingci realized he was facing a difficult decision: whether to continue hiding his wrongdoing or bravely reveal all the truths. His eyes shimmered with regret and anger, and the internal struggle made it nearly impossible for him to breathe.\n\nIn the dim light of the temple, the internal battle of Shi Mingci came to a climax. He began to doubt his choices, deeply regretting his past actions. However, on the flip side, he also felt an indescribable anger, anger towards his own weakness and betrayal. The emotions of Shi Mingci surged like a tide, and he was deeply caught in internal turmoil.\n\nJust then, a faint sound of footsteps was heard, as Shen Zimo walked into the shrine. The eyes of Shi Mingci met his, and in the silence between them, countless unspoken words filled the air. Shi Mingci finally let go of the poisoned prayer bead in his hand, deciding to share everything he knew with Shen Zimo. This time, he chose to courageously reveal all, no longer hiding his wrongdoing.\n\nThere was a sense of acceptance and determination in Shi Mingci's eyes, as he knew this decision would completely alter everything. At this critical moment, Shi Mingci chose to confront his inner fears and guilt, bravely revealing all the truths. His soul found liberation, yet what followed were even more complex interpersonal relationships and conflicts. Shi Mingci's transformation was a turning point in this mysterious case, and a crucial element in the entire storyline.",
            "act_4": "When faced with the final judgment, Monk Ming Ci's heart was turbulent. He stood before the judge, feeling the deep truth gradually being revealed piercing his soul. Monk Ming Ci knew that he could choose to admit his past sins and accept the deserved punishment, but that would mean losing all trust and respect, and everything he had built would crumble. On the other hand, he could continue to insist on his innocence, avoiding responsibility, but that would forever imprison the guilt and shame in the depths of his heart. Under the gaze of the judge, struggling, Monk Ming Ci made a decision. He took a deep breath and slowly confessed his sins. Tears welled in his eyes, and with a deafening judgment pronounced, Monk Ming Ci's heart finally found a moment of peace. He knew that despite facing punishment and shame, at least he could find redemption within himself. Perhaps, as all ends, he could finally forgive himself.",
            "name": "I'm sorry, but \"释明慈\" does not have a direct translation as it seems to be a phrase without clear meaning in this context. Could you provide more context or clarify the phrase so I can help you better?"
        },
        {
            "act_1": "Shiming Ci is a character filled with complex emotions and guilt. In the records of the four days before the incident, he appears calm and kind on the outside, but inside, he is filled with loneliness, confusion, and guilt. There is a huge conflict between his past martial arts identity and his choice to become a monk, which creates inner turmoil for him. This internal contradiction makes him both highly respected yet unable to find peace in the temple. The inner conflict and anxiety of Shiming Ci sharply contrast with his kind outward appearance, revealing his efforts to hide his secrets while yearning for the truth in his interactions with other characters. The interaction between Shiming Ci and Shen Zimo will be a key driver of the plot, and their cooperation or confrontation will determine the revelation of the truth behind the case and the liberation of Shiming Ci's inner self. Throughout the entire script, Shiming Ci's emotional fluctuations, inner secrets, and complex relationships with other characters will provide players with an immersive experience, driving the plot towards a more gripping direction.",
            "act_2": "In this scene, Shi Mingci gradually faces increasingly serious conflicts, and the complexity of the case begins to emerge. Shi Mingci feels lonely, confused, and guilty in his heart, feeling the heavy pressure of his past martial arts identity. The emergence of new clues, especially crucial information related to the divine artifact, drives the plot towards a climax. Shi Mingci realizes that there may be a larger conspiracy behind the divine artifact, plans to discuss the secret of the artifact with Shen Zimo, hoping to uncover the truth behind it. At this point, Shi Mingci faces a major decision: whether to choose to actively reveal the clues he knows or continue to remain silent. The conflict between Shi Mingci, Li Yun, and Shen Zimo also becomes more intense, with the possibility of cooperation or confrontation. Shi Mingci's decision will greatly influence the direction of the plot - whether to maintain the status quo or reveal the hidden secrets? At this point, Shi Mingci's psychological changes are crucial, whether to expose vulnerability or continue to disguise as a calm and rational exterior. Shi Mingci's deep emotional fluctuations in his inner struggle add more tension and twists to the story's development.",
            "act_3": "As the truth of the case gradually unraveled before Shiming Ci, his heart was filled with anger, remorse, and panic. Upon realizing that there might be a bigger conspiracy behind the artifact, he was plunged into extreme inner turmoil. During the process of discussing the secrets of the artifact with Shen Zimo, Shiming Ci's emotions reached a peak as he grappled with whether he should bravely expose all the truths or continue to conceal his own faults. The conflicts between Shiming Ci and the other characters intensified, especially the relationship with Liuyun becoming more complicated. In the end, Shiming Ci wavered in his psychological dilemma, his emotions reaching a breaking point. He needed to make a transformative decision that would impact the direction of the entire plot.",
            "act_4": "At the final moment of the trial, Monk Ming Ci stood in the courtroom, facing the crowd and the judges, with tumultuous emotions in his heart. He knew about his past identity in the martial arts world, and he knew he had many secrets hidden, all of which were about to be revealed. Monk Ming Ci took a deep breath, his eyes flashing with complex emotions.\n\nAs the final moment of judgment arrived, Monk Ming Ci had to make a significant choice. He could choose to admit his wrongdoing and accept the deserved punishment, even though it would cost him the respect and admiration of his followers. Or, he could choose to continue to insist on his innocence, attempting to evade the past sins, but that could implicate more people, and his heart would never truly find redemption.\n\nIn Monk Ming Ci's eyes, there flashed regret, anger, relief, and fear. In the end, he made his choice. He chose to admit his mistakes and accept the consequences of the trial. In that moment, Monk Ming Ci felt a strange sense of relief, as if a heavy burden had been lifted from his heart. Though he would face punishment and loss, he knew it was the only way he could find inner peace and redemption.\n\nThe outcome of the trial revealed Monk Ming Ci's true self, and his choice allowed people to witness his deepest struggles and transformations. Whether declared as a culprit or an innocent, Monk Ming Ci's heart finally found genuine liberation, and his destiny was thereby altered. This conclusion depicted the ultimate destination of Monk Ming Ci's inner world, where he could finally attain self-redemption and embrace a new life.",
            "name": "Shen Zimo"
        },
        {
            "act_1": "On a rainy night on the island of Taiwan, in an old town, a murder occurred inside the \"Cafe Delights\" cafe. Four key characters met here: the elderly mysterious scientist Chen Mingyi, the inspired female painter Cai Yuxuan, the investigative lawyer Zheng Wenyu, and the cafe owner Zhang Hongyi.\n\nThe cafe owner Zhang Hongyi has a calm and composed exterior, but his inner self is filled with anxiety and guilt. He used to be a student of Chen Mingyi but their master-apprentice relationship was shattered due to an accident, leaving him with a sense of guilt. The disparity between his inner and outer selves has led him to be engulfed in various thoughts in the case, deeply troubled by the past entanglements. He is aware of some clues related to the case, but his past experiences and underlying fears affect his judgment and actions. His relationships with other key characters, especially with the mysterious scientist Chen Mingyi and lawyer Zheng Wenyu, are also impacted. His goal is to unravel the troubles in his heart, but he approaches the case with a calm and rational attitude, concealing some truths.\n\nIn this intricate plot, Zhang Hongyi will reveal his multi-faceted personality, gradually exposing his inner secrets, motives, and background through interactions with other characters. His emotional fluctuations and complex relationships will drive the plot forward, providing players with a challenging and mysterious murder mystery experience.",
            "act_2": "In this scene, the coffee shop owner, named Hongyi Zhang, gradually faces escalating conflicts as the complexity of the case starts to unfold. The emergence of new clues, especially crucial pieces of information related to the case, drives the plot towards a climax. Characters begin to realize that their previous judgments may have been wrong, and their own actions might have deeper connections to the case. Describe the emotional fluctuations of the characters at this stage, whether they choose to proactively reveal the knowledge they have or continue to remain silent. During this process, the conflicts between the coffee shop owner, Hongyi Zhang, and other characters intensify, indicating possibilities of collaboration or confrontation. The character's decision will greatly impact the plot – whether to maintain the status quo or reveal hidden secrets? At this point, the character's psychological changes are crucial, whether to expose vulnerability or continue to disguise themselves behind a façade of calm rationality.",
            "act_3": "In this scene, the coffee shop owner, Zhang Hongyi, reaches an emotional climax as the truth behind the case gradually unfolds. As he learns about the tragedy triggered by the mysterious group activities involving his mentor, Chen Mingyi, he feels a mix of anger, regret, and panic. At a crucial moment of psychological dilemma, Zhang Hongyi faces a significant choice: whether to continue hiding his own mistakes or bravely expose all the truths. During his conversation with Chen Mingyi, Zhang Hongyi gradually reveals past secrets, showing the inner conflicts and struggles within himself. He feels guilty for his past mistakes but is also afraid of the consequences of facing the truth. Ultimately, Zhang Hongyi makes a courageous decision to reveal all the truths, confronting his past crimes and inner fears. This transformation is crucial, as Zhang Hongyi's emotional fluctuations and inner struggles are fully displayed in this scene, profoundly affecting the development of the entire plot.",
            "act_4": "In the final scene of the trial, cafe owner Zhang Hongyi stood in the courtroom, facing all the secrets and truths, with his emotions in turmoil. He deeply felt guilty towards his mentor, Chen Mingyi, and uneasy about his past, while also realizing he had to make a crucial choice. Zhang Hongyi's heart was filled with remorse and struggle. He knew he had concealed his connection to Chen Mingyi, but also understood the consequences he would face. At the critical moment of the trial, Zhang Hongyi stood at a crossroads. He could choose to admit his wrongdoing, accept the punishment he deserved, or continue to insist on his innocence, avoiding responsibility. This choice would determine his fate, influencing the ultimate destination of his inner world. Zhang Hongyi ultimately decided to step forward, admit his faults and concealment, and accept the appropriate punishment. He realized that only by facing the past could he find redemption and liberation within. As the trial concluded, Zhang Hongyi's emotions were complex yet pure. He looked towards the future, carrying both regret for the past and hope for the future, embracing a new beginning.",
            "name": "Café owner - surname Zhang, first name Hongyi"
        },
        {
            "act_1": "Lin Yuan, as a mysterious old man, possesses rich knowledge of Taiwanese cultural traditions and mythological backgrounds. Following the murder case, his inner emotional conflict lies in the struggle between his love for and desire to protect Taiwanese culture. On the surface, Lin Yuan maintains a calm and steady demeanor, but internally he is filled with anxiety and unease, worrying about the negative impact the case may have on Taiwanese culture. He is aware of some key clues, such as a dropped necklace and the victim's historical research background, but these clues only deepen his worries and inner conflicts.\n\nIn his relationships with other characters, Lin Yuan has a mentor-student relationship with Lin Ya-wen, having been guided by her in the past. He has a shared history of studying with Chen Yu-xuan, where they mutually respect and trust each other. However, regarding the appearance of the mysterious tourist, Lin Yuan is full of skepticism and suspicion, feeling that the tourist may be hiding important secrets. Throughout the story, Lin Yuan's goal is to protect Taiwanese culture and uncover the truth. His inner secret involves a mysterious experience related to mythological legends, which continues to influence his emotions and actions.\n\nThrough the unfolding of the plot across multiple acts, Lin Yuan will experience emotional fluctuations, changes in motivations, and complex interactions with other characters as he faces the case. His decisiveness, wisdom, and insight will play a crucial role in investigating the case and driving the plot forward. Ultimately, he will face significant choices and challenges, revealing a three-dimensional, profound, and emotionally conflicted character.",
            "act_2": "In this scene, Chen Yuxuan gradually faces increasingly serious conflicts, and the complexity of the case begins to show. The emergence of new clues, especially key information related to the case, drives the plot towards a climax. Characters start to realize that their previous judgments may have been wrong, and perhaps their own actions are more deeply connected to the case. Describe the emotional fluctuations of the characters at this stage, whether to choose to proactively reveal the clues they know or to continue to remain silent. During this process, conflicts between Chen Yuxuan and other characters intensify, there may be cooperation, or there may be confrontation. The character's decision will greatly affect the direction of the plot - whether to maintain the status quo or to uncover hidden secrets. At this point, the character's psychological changes are crucial, whether to expose vulnerability or to continue to disguise their cold and rational facade.",
            "act_3": "In this scene, Lin Yuan gradually uncovers the truth of the case, facing the fear and guilt in his heart. He discovers crucial clues, reveals the identity of the killer, but also realizes his own past mistakes and concealment. Emotions reach a climax, with anger, regret, and panic intertwining. At a critical moment, Lin Yuan faces a major psychological dilemma - whether to expose all the truths or continue to hide his own faults. In conflicts with other characters, especially in the confrontation with Lin Ya Wen, with whom he had a teacher-student relationship, his inner conflicts intensify. Ultimately, Lin Yuan bravely decides to reveal all truths, repent for his mistakes, and show his courage and sense of justice. This scene showcases Lin Yuan's emotional fluctuations and transformation, bringing a major turning point to the development of the entire plot.",
            "act_4": "At the critical moment of trial, Lin Yuan faced the reality of all the secrets and truths that were about to be completely revealed, feeling extremely complex emotions. He deeply understood his responsibility and mission to Taiwanese culture, but at the same time realized that the shadow of this murder case could deeply harm this precious heritage. In the courtroom, Lin Yuan remained silent for a moment, ultimately choosing to confess to his wrongdoing, letting go of all concerns and guilt, and accepting the appropriate punishment. He deeply regretted that his actions had led to such an unfortunate outcome, but also understood that only by facing his mistakes of the past could he truly find inner redemption. At that moment, Lin Yuan's heart was filled with remorse and relief as he finally faced his fate with acceptance, calmly embracing the outcome of the trial. This decision not only affected his personal destiny but also paved a bright path for the future of Taiwanese culture.",
            "name": "Chen Yuxuan"
        },
        {
            "act_1": "On a rainy night, the young lawyer Wen Yan went to a café in a small town to investigate the mysterious case of a scholar. Though he appeared calm and professional on the surface, his heart was filled with anxiety and unease, haunted by shadows from his past involvement in a mysterious group. Wen Yan approached the case with a cool and analytical attitude, but hidden beneath that facade were motives to conceal the truth. Clues about the mysterious group triggered fear and vigilance in his heart, while the death of the scholar left him deeply puzzled and curious.\n\nWen Yan's relationships with other characters were also intricate. He had a mentor-apprentice entanglement and guilt with the café owner Hong Yi, while also relying on Hong Yi's information to advance the case. His interaction with the young female artist Cai Yuxuan revealed a resonance and understanding of the mysterious events, perhaps indicating that her art could provide crucial clues for him.\n\nThe contrast between Wen Yan's inner conflicts and his cold demeanor, along with the complex and tense interactions with other characters, injected more dramatic tension and suspense into the entire plot. His background story and psychological state would gradually unravel the truth behind the case, providing players with more choices and challenges.",
            "act_2": "In this scene, the young lawyer - named Zheng Wenyang, gradually faces increasing conflicts as the complexity of the case begins to emerge. The appearance of new clues, especially key information related to the case, drives the plot towards a climax. The character begins to realize that their previous judgment may have been incorrect, and that their actions may have deeper connections to the case. Describe the emotional fluctuations of the character at this stage, whether they choose to actively reveal the clues they know or continue to remain silent. In this process, the conflicts between the young lawyer - named Zheng Wenyang and other characters become more intense, possibly involving cooperation or confrontation. The character's decision will greatly affect the direction of the plot—whether to maintain the status quo or uncover hidden secrets. At this point, the character's psychological changes are crucial, whether to expose vulnerability or continue to disguise themselves as calm and rational.",
            "act_3": "In this scene, the young lawyer Zheng Wenyi experiences intense internal turmoil and emotional climax. He finally uncovers the truth of the case, discovering the existence of a mysterious organization and his own past wrongful involvement. Faced with this fact, he feels a mix of anger and regret, panic and struggle. In the confrontation with other characters, especially with the old occultist Chen Mingyi, the conflict intensifies, and Zheng Wenyi's emotions reach their limit.\n\nAt a crucial moment of psychological decision-making, Zheng Wenyi stands at a crossroads and must make a significant choice: to continue concealing his faults, persisting in remorselessness, or bravely expose all truths and take responsibility. This decision will determine the direction of the entire plot and the development of character relationships. Zheng Wenyi's inner struggle and emotional fluctuations are fully displayed in this scene, allowing the audience to feel his conflict and contradictions, as well as the potential emotional outbursts. This turning point will inject more tension and depth into the entire storyline, leading the story towards a more intense and suspenseful climax.",
            "act_4": "At a crucial moment in the trial, young lawyer Wen Yan faces an unprecedented psychological struggle. Standing in the courtroom, he witnesses all secrets and truths being revealed, including his own past and the activities of a mysterious group he was involved in. Turbulent emotions swirl within him, as guilt, fear, anger, and despair intertwine.\n\nWen Yan knows that now is the moment for him to make a critical choice: to admit his crimes, accept the deserved punishment, or to continue to insist on his innocence and evade responsibility. His legal instincts tell him that denying the crimes might help him escape legal sanctions, but his conscience is nagging at him for hiding the truth.\n\nAt the final moment of the trial, Wen Yan steps forward, facing the judge and jury, and decisively admits to his crimes, revealing all the lies and deceptions. He chooses honesty and truth, letting go of all burdens and shadows. Despite facing severe punishment, he feels inner liberation and self-redemption.\n\nWen Yan's choice not only affects his own fate but also changes how other characters view him. His bravery and sincerity touch everyone, revealing his inner strength and remorse. Regardless of the outcome, Wen Yan goes through a profound baptism during the trial, ultimately finding inner peace and reconciliation.",
            "name": "Young lawyer - surname Zheng, first name Wenyan"
        },
        {
            "act_1": "In the case of the Blue Dragon Temple, Ye Ming, as a devout custodian, harbors a belief and fear of the power of the divine dragon deep within his heart. Four days before the case occurred, his heart was gradually shrouded in unease and doubts, while he also struggled to ensure the safety of the temple and the protection of the divine dragon. At the same time, Lin Zhengyi, a renowned archaeologist, was drawn into the vortex of the case due to his reverence for ancient artifacts and traditions. Four days before the case occurred, his heart went through a struggle between tradition and friendship, as well as facing the dilemma of concealing or revealing the truth. And Chen Wanru, a young female detective, driven by her passion for the case and sense of justice, continuously seeks the truth. Four days before the case occurred, her heart experienced an understanding of the complexity of the case and concerns about the secrets within the temple, while also facing the shadows and challenges of her past experiences. The emotional journeys of these three characters will intertwine in the case of the Blue Dragon Temple, collectively unraveling a deep mystery related to myths, legends, and culture, adding more drama and tension to the whole story. Wishing the game a smooth progress, allowing each player to deeply experience the emotional fluctuations and complex relationships of the characters.",
            "act_2": "In this scene, Lin Zhengyi feels the escalation of internal conflicts and struggles. Faced with the complexity of the case and the emergence of new clues, he begins to realize that the ancient texts he knows about the Temple of the Divine Dragon may be a key clue. However, after grasping this information, Lin Zhengyi is deeply conflicted internally about whether he should reveal this secret and expose the truth hidden within the temple. He starts to doubt his choices and also questions whether Ye Ming is aware of these secrets. This inner doubt and struggle gradually lead to conflicts between him and Ye Ming, making the choice between friendship and truth even more difficult. Lin Zhengyi is mentally tortured, and his decision will determine the development of the whole story - whether to maintain the status quo and keep the secret, or to uncover the hidden secrets in pursuit of the truth. Lin Zhengyi's inner changes and decisions will greatly influence the climax and direction of the plot.",
            "act_3": "In this scene, Lin Zhengyi finally faces the truth of the case, as he struggles with fear and guilt in his heart. In a corner of the temple, he discovers a special record about the statue of the divine dragon, revealing important clues related to the case. Lin Zhengyi is torn between his reverence and protection of ancient artifacts, and his loyalty to Ye Ming and the temple. As his emotions reach a climax, anger, regret, and panic intertwine within him.\n\nFaced with a major psychological dilemma, Lin Zhengyi must decide whether to continue concealing this crucial information or bravely expose everything. This choice will directly impact the development of the case and his relationship with Ye Ming. Lin Zhengyi begins to realize that the information he holds could change everything, but it also means betraying his friend and faith. In this inner struggle, Lin Zhengyi's transformation becomes a key turning point in the entire story.\n\nAs Lin Zhengyi's emotional turmoil reaches its peak, he decides to step forward and reveal the truth. He engages in a fierce confrontation with Ye Ming, where the two former friends find themselves in serious disagreement between morals and interests. Lin Zhengyi's regret and courage intertwine at this moment as he chooses to face his mistakes and honestly reveal the long-hidden secret. This decision not only alters the course of the case but also brings some kind of relief to Lin Zhengyi's heart. Despite facing unknown consequences, he chooses to bravely confront them.",
            "act_4": "In the final trial of the Qinglong Temple case, Lin Zhengyi stood in front of the judgment platform, facing the scrutiny of the crowd and the critical choice in the case. His heart was tumultuous like a storm, with a deep appreciation for traditional culture, loyalty to his friend Ye Ming, and the ancient texts he had discovered about the statue of the divine dragon. These conflicting emotions intertwined, leading him into an indescribable struggle.\n\nLin Zhengyi's eyes flickered with hesitation and confusion. He knew he held the key information that could change everything, but he also realized that revealing the truth might destroy his friendship with Ye Ming and shake the foundation of belief in Qinglong Temple. Under the judge's questioning, Lin Zhengyi's voice trembled slightly, \"I... I found some special records about the statue of the divine dragon, which may help unravel the mysteries of the case.\"\n\nHis words caused a stir, and the courtroom suddenly fell silent, with all eyes fixed on him. Lin Zhengyi's heart at that moment felt like it was being consumed by flames. He knew his choice would change everything. Should he uphold the concealment, preserving the purity of ancient culture, or should he uncover the truth, facing the test of friendship and responsibility?\n\nFinally, in a solemn atmosphere, Lin Zhengyi struggled to make a decision, \"I choose... to reveal everything.\" This sentence rang out like a thunderbolt in the courtroom, touching everyone with his courage and honesty. A firm light shone in Lin Zhengyi's eyes. He knew that this choice might change everything, but he was willing to bear all consequences for justice and truth.\n\nAt that moment, Lin Zhengyi's heart felt liberated. He felt a sense of inexplicable ease and relief. Whatever the ultimate outcome, he chose to bravely face his past and present, in pursuit of inner justice and honesty, as well as for the eternal continuity of friendship and traditional culture. In the conclusion of this trial, Lin Zhengyi exhibited sincerity and courage from within, leaving an unforgettable mark on the entire Qinglong Temple case.",
            "name": "Lin Zhengyi"
        },
        {
            "act_1": "Mysterious old man Lin Yuan makes an appearance in a small town café on the island of Taiwan, appearing calm and composed on the outside but filled with anxiety and worry on the inside. Lin Yuan is a retired folklore professor with a deep research and love for Taiwanese culture. In this murder case, his motive is to protect Taiwan's traditional cultural heritage and prevent any harm to the culture. However, he harbors a mysterious experience from his youth that still troubles him. He has deep connections with the other three key characters, particularly with the young woman Lin Ya-wen, with whom he shares a teacher-student relationship, having been guided by her during his university days. Lin Yuan uncovers crucial clues during the investigation, such as a dropped necklace and details from the victim's historical research background, sparking his thinking and deduction. Through his interactions with other characters, he displays his love for Taiwanese culture and pursuit of the truth, playing an important role in the development of the entire case. In this perplexing murder case, Lin Yuan will reveal more truths about the historical facts of Taiwanese culture, showing his inner emotional fluctuations and attitude towards the case.",
            "act_2": "In this scene, the mysterious old man Lin Yuan is alone in a cafe, drinking tea and reminiscing about his mysterious experiences in his youth. He feels uneasy, worried that the murder case that happened might affect Taiwanese culture. Lin Yuan hopes to protect Taiwan's traditional culture through his efforts and does not want to see cultural heritage harmed. At this critical moment, the appearance of a new clue makes him start doubting everyone around him, not knowing who the real murderer is. Lin Yuan decides to secretly investigate the case, protect the victims, and uncover the truth. Consulting with Lin Yawen about the progress of the case shows their shared love for Taiwanese culture. In the fluctuation of emotions and inner struggles, Lin Yuan's decision will greatly influence the direction of the plot. Will he choose to proactively reveal the clues he knows, or continue to remain silent and keep the crucial information to himself? Conflicts with other characters will intensify, with possibilities of cooperation or confrontation. Lin Yuan's psychological changes will be a key factor in the story's development, as his decisions will determine whether to maintain the status quo or reveal hidden secrets. In this scene, Lin Yuan will experience emotional fluctuations and decision-making struggles, providing a crucial driving force for the climax of the whole plot.",
            "act_3": "In this scene, Lin Yuan is deeply immersed in inner fear and guilt. As he gradually uncovers the truth of the case, his emotions reach a climax, with anger, regret, and panic intertwining. He is faced with a significant psychological decision: whether to continue hiding his wrongdoing or bravely reveal all the truths. During the process of revelation, Lin Yuan clashes with other characters, particularly escalating conflicts with the young woman Lin Yawen. His transformation is crucial; will he make a repentant choice or persist in his own ways? Lin Yuan's emotional fluctuations are fully displayed at critical moments, especially when facing the final confrontation, he shows extreme reactions, demonstrating his inner struggle and firm belief.",
            "act_4": "The mysterious old man Lin Yuan was filled with complex emotional turmoil when facing the final judgment or significant decision. He deeply understood his responsibility and impact in this murder case, agonizing between admitting guilt and continuing to insist on innocence. In the end, Lin Yuan bravely decided to admit his crime, accept the deserved punishment, and take responsibility for his actions. His heart was filled with regret and penitence, but at the same time, he also felt a sense of liberation and hope for self-redemption. This decision would completely change his fate, allowing him to find a kind of peace and forgiveness deep within his heart. Lin Yuan ultimately chose to confront his past responsibilities, thus truly achieving self-redemption and liberation.",
            "name": "Mysterious old man"
        },
        {
            "act_1": "In a ancient village on the island of Taiwan, a mysterious murder case took place. The incident occurred in a temple, where the ancient building was filled with a mysterious atmosphere. The victim was a highly respected monk named Shi Mingci by the villagers, who guarded a legendary artifact in the temple. Shi Mingci lost his father in his childhood and was taken in by the temple, showing exceptional wisdom and compassion from a young age. He hid a past unknown to others, having been a martial arts master, and chose to become a monk to escape past conflicts. The cause of Shi Mingci's death was poisoning, and the culprit turned out to be his trusted aide.\n\nIn the four days leading up to the incident, Shi Mingci felt lonely, confused, and guilty, burdened by the weight of his past martial arts identity. He hoped for understanding and forgiveness, intending to confess his past identity to his trusted disciple. Meanwhile, Shi Mingci realized that there might be a larger conspiracy behind the artifact and planned to discuss its secrets with the young scholar Shen Zimo to uncover the truth behind it. However, Shi Mingci began to suspect the true intentions of the merchant Liu Yun from out of town, secretly investigating Liu Yun's background to prevent any mishaps.\n\nThe interplay between Shi Mingci and the other characters is complex, with each person hiding their own secrets and motives. As the mystery unfolds, a shocking truth is about to be revealed, exposing a larger conspiracy behind the murder case. In the script, Shi Mingci will show his inner loneliness, confusion, and guilt, as well as the conflict between his past and his aspirations for the future. His actions will drive the story forward, greatly impacting the decisions of the other characters.",
            "act_2": "In this scene, Liu Yun gradually faces increasingly serious conflicts, and the complexity of the case begins to emerge. The emergence of new clues, especially key information related to the case, drives the plot towards a climax. Characters begin to realize that their previous judgments may have been wrong, and perhaps their actions are more deeply connected to the case. Describe the emotional fluctuations of the characters at this stage, whether to choose to actively reveal what they know, or to continue to remain silent. During this process, conflicts between Liu Yun and other characters intensify, there may be cooperation, or there may be confrontation. The character's decision will greatly influence the direction of the plot—whether to maintain the status quo or uncover hidden secrets. The character's psychological changes at this moment are crucial, whether to expose vulnerability or to continue to disguise themselves as calm and rational.",
            "act_3": "In this scene, Shi Mingci experienced intense emotional turmoil as he faced his long-hidden martial arts identity and complex relationship with a mysterious figure. Shi Mingci found himself lost and filled with guilt, deeply regretting his past choices. At a crucial moment of revealing the truth behind the case, Shi Mingci's emotions reached a climax, with anger, regret, and fear intertwining. He must confront a major psychological dilemma - whether to continue hiding the secrets of the past or bravely expose the truth and face the consequences. In his interactions with Li Yun and Shen Zimo, Shi Mingci sensed a greater conspiracy and danger, with internal conflicts and confusion pushing his emotions to the extreme. His transformation at the final confrontation will determine the direction of the entire plot, whether he will repent or persist in concealing the truth. Shi Mingci's inner turmoil and struggle will be fully displayed in this scene, adding more tension to the story's climax and turning point.",
            "act_4": "Shiming stood before the judgment seat, facing the moment when all secrets and truths were about to be revealed. He was deeply conflicted inside, on one hand wanting to confess his past identity in the martial arts world and accept his previous wrongdoings, but on the other hand, wishing to evade responsibility and continue insisting on his innocence. Shiming's emotions reached a climax at this moment, with regret, anger, and fear intertwining, as he struggled within himself.\n\nUltimately, Shiming decided to choose to acknowledge his past, accept his crimes, and receive the punishment of judgment. Facing the scrutiny of the crowd, he shed all disguises and pretenses, revealing his most authentic self. He realized that avoiding and denying would not alter the facts, only by bravely confronting and accepting his past could he truly attain inner redemption.\n\nShiming's choice not only impacted his own fate but also caused a shift in how others viewed him. In the final outcome, although facing punishment and responsibility, Shiming also found inner release and peace, ultimately achieving self-redemption. This ending showcases the ultimate destination of Shiming's inner world. His courage and sincerity displayed when facing judgment evoke admiration and contemplation.",
            "name": "Yun Liu"
        },
        {
            "act_1": "Lin Yawen is a well-educated folklorist, with a deep research and understanding of the traditional culture of Taiwan. On the surface, she presents a confident and firm image, but inside hides an anxiety and fear stemming from witnessing a murder case as a child. This experience has made her particularly persistent about justice and truth, hoping to uncover the truth and protect the rights of the victims through her involvement in this case. She has a mentor-student relationship with the mysterious elderly man Lin Yuan, whose presence makes her feel a certain pressure and sense of responsibility. Yawen's relationships with other key characters are complicated, especially the convoluted past she shares with Lin Yuan, which affects her emotions and attitude. Faced with the case, she displays both a calm analytical side and conceals certain truths; the internal conflicts and struggles make her character more dimensional and complex.",
            "act_2": "In this scene, Lin Yawen faces escalating conflicts and challenges. The emergence of new clues makes her begin to doubt her judgment and choices. She discovers some crucial information that could reveal deeper secrets of the case, causing intense emotional turmoil within her. Lin Yawen is unsure whether she should proactively reveal the clues she holds or choose to remain silent. Her relationships with other characters become more tense at this stage, with potential for collaboration or confrontation. Lin Yawen's decision will greatly impact the direction of the plot - whether to maintain the status quo or uncover hidden secrets. Her inner struggle and emotional changes will reach a climax in this scene, where she may expose a vulnerable side or continue to disguise herself as calm and rational. This process will bring more tension and twists to the development of the entire plot.",
            "act_3": "In this scene, Lin Yawen gradually uncovers the truth during the investigation of the case, facing the deep fears and guilt within her heart. Her emotions reach a climax, with anger, remorse, and panic intertwining. Ultimately, Lin Yawen faces a major psychological dilemma - whether to continue hiding her wrongdoing or bravely reveal all the facts. During the revelation process, she experiences intense conflicts with other characters, especially escalating conflicts with the mysterious old man Lin Yuan. Lin Yawen's transformation is crucial; she must decide between repentance or remaining stubborn. At this critical moment, her emotional fluctuations are fully displayed, especially when facing confrontation, she exhibits extreme reactions. This scene vividly portrays Lin Yawen's inner struggles and emotional fluctuations, bringing about a significant turning point in the entire storyline.",
            "act_4": "Lin Yawen stood in front of the judgment, conflicted in her heart. She knew deep down that she was innocent, but also understood that confessing to the crime might be the only way out. Facing the public eye, her heart was filled with regret, anger, and despair. Ultimately, Lin Yawen chose to confess her innocence and accept the judgment. She sacrificed herself for others, choosing to bear the fate of being wronged in order to protect Taiwanese culture and tradition. The end of the judgment was not the end for her, but a new beginning, a new beginning filled with endless regret and heartache. This choice brought a strange sense of relief to her heart, while leaving an indelible pain in the depths of her soul.",
            "name": "Lin Ya-wen"
        },
        {
            "act_1": "Lin Yawen is a well-educated folklorist who has a deep study and love for the traditional culture of Taiwan. She appears calm and confident on the outside, but inside she hides anxiety and fear, stemming from witnessing a murder case as a child, which has instilled in her a special dedication to justice and truth. In this murder case, Lin Yawen's motivation is to uncover the truth, protect the rights of the victims, and uphold justice. She has a mentor-mentee relationship with the mysterious old man Lin Yuan, having received his guidance and teachings, which influences her attitude and emotional fluctuations towards the case. Lin Yawen carries a deep love and dedication for Taiwanese culture, but the inner fear and anxiety make her more determined and courageous when faced with a case.",
            "act_2": "In this scene, Lin Yawen gradually faces increasingly serious conflicts as the complexity of the case begins to emerge. The appearance of new clues, especially key information related to the case, drives the plot towards a climax. Characters start to realize that their previous judgments may have been mistaken, and perhaps their actions are more deeply connected to the case. Describe the emotional fluctuations of the characters at this stage, whether they choose to actively reveal the information they know or continue to remain silent. During this process, conflicts between Lin Yawen and other characters intensify, potentially involving cooperation or confrontation. The character's decision will greatly influence the direction of the plot—whether to maintain the status quo or reveal hidden secrets. At this point, the character's psychological changes are crucial—whether to expose vulnerability or continue to disguise themselves as calm and rational.",
            "act_3": "In this scene, the young woman Lin Ya-Wen gradually uncovers the truth of a murder case as she investigates it. She discovers some crucial clues that reveal the identity of the victim and the complexity of the case. Lin Ya-Wen's emotions are greatly affected, with feelings of anger, regret, and panic intertwined. She faces a significant psychological dilemma: whether to continue hiding her own wrongdoing or bravely expose all the truth. In the conflicts with other characters, especially in the confrontation with the mysterious old man Lin Yuan, Lin Ya-Wen's inner turmoil intensifies. Eventually, she makes a bold choice to reveal all the truth, no matter the cost. This turning point determines the direction of the entire plot and also showcases Lin Ya-Wen's growth and determination.",
            "act_4": "When the young woman Lin Ya Wen faced the final judgment or a major decision, her heart was filled with regret, anger, and fear. She stood in front of the judgment seat, examining her past choices and actions. Should she admit her crimes, accept punishment, or continue to insist on her innocence and evade responsibility? Lin Ya Wen knew deep down the truth of the murder case she had witnessed, but inner fear and self-preservation made her hesitate. In the end, at the final moment of judgment, Lin Ya Wen chose to reveal the truth and admit her crimes. Tears streamed down her face, regret and guilt engulfed her soul. Although she accepted punishment, Lin Ya Wen felt a slight sense of relief from within, because she chose justice and truth, bringing justice to the victim. This decision also gave her a sense of self-redemption in her heart, even though she knew this choice would forever change her destiny.",
            "name": "Young woman"
        }
    ],
    "host": {
        "host_guide_character_allocation": "The mysterious scholar Chen Mingyi is a highly respected occultist on the island of Taiwan, well-versed in myths, legends, and local culture. The young female artist Cai Yuxuan is full of creativity and curiosity about mysterious events. The young lawyer Zheng Wenyant is intelligent and passionate about uncovering the truth. The coffee shop owner Zhang Hongyi is thoughtful and conflicted about the tensions between master and disciple.\n\nCai Yuxuan is suitable for players who enjoy exploring mysterious events and searching for clues. It is recommended to assign her to players who enjoy deduction and artistic creation. Pay attention to her artworks and hidden clues, as they will be crucial for solving the mysteries.\n\nWhen assigning roles, consider linking the secrets of Chen Mingyi with the eyewitness events of Cai Yuxuan to enhance the depth of the plot. Zheng Wenyant, as a collector of clues related to the mysterious group, can raise more questions about his relationship with the old occultist. The emotional conflict between Zhang Hongyi and his disciple can provide players with more room for thought and interaction.\n\nA special note is to ensure that each player can fully utilize the characteristics of their role while promoting interaction and cooperation between the characters to smoothly advance the game plot. Good luck with the game and unraveling the mysteries!",
        "host_guide_clues": "Clue Distribution Guide:\n\n1. Timing and Sequence of Clue Distribution:\n- Determine the timing of clue distribution in each round of the game, for example, each character receives a clue after each round ends.\n- Ensure a systematic sequence of clue distribution to gradually reveal the truth of the case.\n\n2. Different Ways of Distributing Clues:\n- Reveal clues through character dialogues or actions, for example, clues hidden in Cai Yuxuan's artwork.\n- Hide clues using items or environmental elements, such as books discovered by the old mystic in ancient scriptures.\n\n3. Controlling the Pace of Information Disclosure:\n- Ensure that players receive sufficient clues in each round, without revealing them too obviously.\n- Guide the disclosure of clues through character interactions and discussions to maintain players' interest and suspense in the story.\n\n4. Handling Special Clues:\n- For special clues, such as misleading clues, ensure they guide players' thinking rather than directly mislead them.\n- Reveal special clues when players need them the most to increase the challenge and fun of solving puzzles.\n\nWith the above guidelines, the host can flexibly control the distribution of clues based on the game progress and player feedback, ensuring a smooth game flow, enriching player experience, and ultimately unraveling the mystery of the murder case.",
        "host_guide_discussion": "Detailed guidelines for the five rounds of discussion:\n\nExpected goals for the first round of discussion:\n- Guide players to understand the basic information and background of their characters, creating an atmosphere of interaction between the characters.\n- Help players build curiosity and desire to explore the case of the mysterious scholar.\n\nDirections the host should guide:\n- Encourage Cai Yuxuan to showcase her artistic talents and interest in the case to stimulate the cooperation of other players.\n- Encourage players to share observations and guesses about mysterious symbols and hidden clues, driving the discussion towards collecting clues.\n\nPossible issues and solutions:\n- Players may show reservation or a wait-and-see attitude in the first round; the host can stimulate player enthusiasm through active guidance and questioning.\n- If players deviate from the topic or engage in arguments during the discussion, the host can remind everyone to maintain the order and goals of the discussion.\n\nTime management techniques:\n- In the first round of discussion, the host can set a time limit for each player's introduction to ensure the discussion does not drag on.\n- Timely grasp the discussion atmosphere, guide the discussion content appropriately, and prevent the discussion from veering off the topic or getting stuck.",
        "host_guide_flow": "Game Process and Schedule:\n\n1. Self-Introduction Phase (30 minutes):\n   - Each player portrays a character to introduce themselves, showcasing character traits and key clues.\n   - Each character reveals personal secrets and motivations to spark curiosity and cooperation among other players.\n   \n2. Clue Collection and Discussion Phase (60 minutes):\n   - Players collectively gather clues, discussing the background of the case and relationships between characters.\n   - Each character presents key clues to guide the discussion in the right direction.\n   \n3. Additional Clue Collection Phase (45 minutes):\n   - Players gather clues again to gain a deeper understanding of the intersections and secrets between characters.\n   - Each character in this phase ponders the case deeply, filtering useful information.\n   \n4. Voting, Reasoning, and Revealing the Killer (45 minutes):\n   - Players vote and reason to choose the killer based on collected clues and character behaviors.\n   - Each character, through reasoning and judgment, makes the final choice to unveil the killer's identity.\n   \nPossible Time Adjustment Plans:\n- If the discussion time among players is long, the self-introduction time can be compressed appropriately to ensure the smooth progress of subsequent stages.\n- If players are slow to understand clues, the clue collection and discussion phase can be extended to increase player interaction.\n- If there is insufficient time for the voting and reasoning stage, the time for collecting clues again can be reduced to ensure the game ends smoothly.\n\nKey Time Reminders:\n- Control each round within the specified time range to ensure a smooth game flow.\n- Maintain character traits and story clues while role-playing to enhance the fun of the game.\n- Before unveiling the killer, remind players to review all clues and make accurate deductions.",
        "host_guide_intro": "In a quaint ancient town on the island of Taiwan, there is a café called \"Cafe Delights.\" It has a warm and rustic atmosphere, attracting a variety of people to come and taste delicious coffee and pastries. However, the peaceful and tranquil atmosphere was shattered by a murder case.\n\nThe incident took place on a rainy night, where four key characters met in the café. The first character is an elderly man, a renowned local occultist who knows the myths and legends of Taiwan like the back of his hand. The second character is a young female painter known for her artworks inspired by mythological themes. The third character is a young lawyer from the city who came to investigate a case involving the occultist. The owner of \"Cafe Delights\" is the fourth character, a middle-aged man of thoughtful demeanor and a student of the local occultist.\n\nA heated argument ensued in the café, and the old occultist was found dead in a corner. The case is full of mysteries, with each character having their own secrets and motives. Did the female painter feel jealous of the occultist's mysterious knowledge? Does the young lawyer have ulterior motives? Did the owner conceal his connection with the old occultist? Who is the real culprit? What secrets and conspiracies lie behind this murder case? Through this story, players will be immersed in a complex plot full of Taiwanese myths and cultural history, challenging their intelligence and courage to solve the mystery. This game is suitable for players who enjoy solving puzzles, mysteries, and cultural legends.",
        "host_guide_tips": "Writing Hosting Tips\n\nPractical hosting techniques include:\n\n1. Atmosphere creation methods:\n   - Before the game starts, create a mysterious atmosphere by adjusting background music and lighting.\n   - The host's tone and expressions should match the plot, guiding players into their roles.\n   - Use props and decorations to create a realistic scene and enhance immersion.\n\n2. Player conflict management:\n   - Pay attention to the interaction between players and resolve potential conflicts in a timely manner.\n   - Guide players to solve problems cooperatively, avoiding conflicts between characters.\n   - Provide timely hints and clues to help players progress smoothly in the game.\n\n3. Rhythm control techniques:\n   - Control the pace of the game to ensure that each stage has enough time and space to unfold.\n   - Remind players of task progress regularly to prevent the game from dragging on or becoming too rushed.\n   - Flexibly adjust the rhythm based on player feedback and changes in atmosphere.\n\n4. Emergency situation handling:\n   - Prepare backup clues and character motivations for unforeseen circumstances.\n   - Adjust the game progress promptly in response to emergencies or inappropriate player behavior to maintain smooth gameplay.\n   - Stay calm and composed, deal with unexpected situations, and ensure the smooth running of the game.\n\n5. Techniques to enhance immersion:\n   - Use sound effects and visual effects to enhance player immersion, allowing them to better immerse themselves in their roles.\n   - Design diverse puzzles and tasks to stimulate players' interest and challenge in decryption.\n   - Pay attention to details and character backgrounds, providing players with a realistic and immersive experience in the game.",
        "host_guide_voting": "Voting Process Guidelines:\n\n1. Explanation of Voting Rules:\nDuring the final stage of the game, the host will notify players to vote for the character they believe is the real culprit. Each player will privately choose their suspected killer and submit their vote to the host.\n\n2. How to Guide Players in Making Choices:\nThe host can remind players to review all the clues and events of the case, to consider the motives and secrets of each character. Players should make their choice based on their reasoning and judgment of who they think is most likely to be the real culprit.\n\n3. Trigger Conditions for Different Endings:\nDifferent voting results will trigger different endings. If the majority of players choose the correct killer, the game will reveal the truth and the case will be solved. If players' voting results differ, multiple endings may be presented for players to discuss and analyze.\n\n4. Dramatic Presentation of the Revelation of Endings:\nThe host can reveal the voting results in a dramatic way, gradually uncovering the secrets and truth of each character. Sound effects, props, or character interactions can be used to enhance the atmosphere, allowing players to experience the suspenseful and exciting process of the ending revelation."
    },
    "images": [
        "https://images.pexels.com/photos/2193600/pexels-photo-2193600.jpeg",
        "https://images.pexels.com/photos/163077/mario-yoschi-figures-funny-163077.jpeg",
        "https://images.pexels.com/photos/1446948/pexels-photo-1446948.jpeg"
    ]
}