{
    "Script Planner": " Her connection to the spirit world and the mystical forces of Jeju make her a person of interest in the investigation, as her motives remain shrouded in mystery.\n\nAs the investigation unfolds, Seo-jin, Hae-won, Dae-hyun, and Soo-min find themselves drawn together by threads of fate and intrigue, each wrestling with their own demons and desires. Their quest for the truth takes them deep into the heart of Jeju's legends, where ancient spirits and forgotten prophecies hold the key to unraveling Mae-hwa's murder.\n\nThe lines between reality and myth blur as the four individuals navigate a treacherous path of deception, betrayal, and magic. In a race against time, they must confront their own inner demons and uncover the truth behind Mae-hwa's death before dark forces awaken and Jeju Island is plunged into chaos.\n\nWill they be able to untangle the web of lies that binds them, or will they succumb to the darkness that lurks beneath the surface of Jeju's mystical world? Only time will tell as our four protagonists embark on a journey that will test their courage, loyalty, and ultimately, their own humanity.\n\nUltimately, the killer is revealed to be Mae-hwa's closest friend, who had orchestrated the murder in a jealous rage over Mae-hwa's relationship with the wealthy businessman. The friend's intricate plan to frame each of the suspects only added to the complexity of the case.\n\nAs the truth comes to light, Lee-ho must confront the dark truths that lie buried beneath the paradisiacal facade of Jeju Island. The secrets uncovered in this investigation will forever alter the lives of those involved, leaving scars that may never fully heal.\n\nThrough it all, Lee-ho remains a steadfast and determined detective, unearthing the hidden truths and shedding light on the darkness that lurks beneath the surface. \"Prodigal Island\" is a gripping tale of mystery, intrigue, and the unbreakable bonds that tie us to our pasts - for better or for worse.",
    "Character Designer": "Soo-min:\n   - Backstory: Soo-min has always had a gift for healing and a strong connection to nature, earning her a reputation as a powerful healer on the island. She believes in maintaining balance and harmony in all things.\n   - Motivation: Soo-min is driven by a desire to protect the island and its people, using her abilities to heal and bring peace where there is turmoil.\n   - Secret: Soo-min harbors a secret love for Mae-hwa, a forbidden passion that she struggles to keep hidden as she mourns her lost love.\n   - Relationship: Soo-min has a complicated relationship with Hae-won, whom she once was close to but now feels a distance growing between them as their secrets threaten to tear them apart. Sun-hwa:\n   - Backstory: Sun-hwa is a talented and ambitious journalist who has faced discrimination and barriers in the male-dominated field of investigative reporting.\n   - Motivation: Sun-hwa is driven by a passion for uncovering the truth and seeking justice for the voiceless, using her skills to hold powerful individuals like Dae-hyun accountable for their actions.\n   - Secret: Sun-hwa hides her vulnerability and insecurities behind a tough exterior, afraid to let others see her doubts and fears about whether she can truly make a difference in a corrupt world.\n   - Relationship: Sun-hwa's connection with Mae-hwa runs deep, as they share a bond forged in their pursuit of justice and a mutual respect for each other's strength and determination.\n\n5. Mae-hwa:\n   - Backstory: Mae-hwa was a courageous activist dedicated to fighting for the rights of marginalized communities, motivated by a personal tragedy that fueled her determination to make a difference.\n   - Motivation: Mae-hwa's driving force is seeking justice and exposing the corruption and abuse of power that she witnessed firsthand, even at great personal risk.\n   - Secret: Mae-hwa carries the burden of a traumatic event from her past that haunts her, shaping her actions and fueling her relentless pursuit of truth and accountability.\n   - Relationship: Mae-hwa's relationships with Dae-hyun and Sun-hwa are complex, as both individuals played pivotal roles in her life and in the events that ultimately led to her mysterious disappearance.Together, they navigate the treacherous waters of suspicion and deception, unraveling the tangled threads of the island's past to uncover the truth that has long been buried. As they delve deeper into the mysteries that shroud Jeju Island, they must confront their own inner demons and face the consequences of their choices, ultimately coming to terms with the darkness that lies within each of them.\n\nIn the end, it is their resilience, courage, and unwavering determination that will lead them to the heart of the island's secrets, where the ultimate truth awaits. And as they face their greatest challenge yet, they will discover that the bonds of friendship, love, and loyalty are the strongest weapons they possess in the battle against the shadows that threaten to engulf them.",
    "Script Writer": "Day 2: Hae-won's creative spirit is invigorated by the island's magic, inspiring her to explore the untamed beauty that surrounds her. She stumbles upon an old abandoned lighthouse, its weathered walls a blank canvas calling out for her vivid imagination. As she envisions the light-filled with the stories of lost sailors, a sense of foreboding lingers in the air.\nDay 3: Hae-won's artistic journey takes her deeper into the heart of the island, where she uncovers a hidden grove of ancient trees shrouded in mist. The whispers of the forest beckon her to capture their secrets on canvas, revealing a forgotten history of love and betrayal that haunts the twisted roots. The mystical aura of the grove stirs a primal longing in her soul, awakening a power she never knew she possessed.\nDay 4: As Hae-won grapples with the enigmatic forces that bind her to the island, a vision of Mae-hwa's death flashes before her eyes, sending a shiver down her spine. The threads of fate weave a tangled web around her, drawing her closer to the truth that lies hidden in the shadows. With each brushstroke, Hae-won unravels the mysteries that bind her to the island, uncovering a painful past that threatens to consume her.\nDay 2: The news of Mae-hwa's murder sends shockwaves through Dae-hyun's carefully constructed world, forcing him to confront his own vulnerabilities and fears. The whispers of betrayal and conspiracy grow louder, threatening to topple the foundations of his ambition. As he delves deeper into the investigation, Dae-hyun uncovers a tangled web of secrets that lead him to question everything he thought he knew.\nDay 3: Dae-hyun's interactions with Hae-won and Soo-min reveal glimpses of their hidden depths, stirring a curious mixture of admiration and suspicion within him. The lines between ally and enemy blur as he struggles to unravel the truth behind Mae-hwa's death. The weight of responsibility and duty weighs heavily on his shoulders, driving him to seek answers in the shadows of Jeju Island.\nDay 4: Standing at the crossroads of power and fate, Dae-hyun faces a choice that will define his legacy. The visions of Mae-hwa's prophecy haunt him, guiding his hand towards a path he never thought he would tread. As the truth behind the shaman's murder unravels, Dae-hyun must confront the darkness within himself and embrace the light of redemption.\nDay 2: Mae-hwa's murder shakes Soo-min to her core, casting a shadow of fear and uncertainty over her once peaceful existence. As she tends to the wounded and broken in the aftermath of the tragedy, a sense of foreboding settles in her heart. The whispers of the villagers grow louder, pointing fingers in every direction, including her own.\nDay 3: Soo-min's instincts as a healer compel her to seek out the truth behind Mae-hwa's death, her intuition guiding her through the dark and twisted labyrinth of secrets. The weight of suspicion bears down on her, threatening to tarnish her reputation and shatter her sense of security. As she uncovers hidden truths and long-buried lies, Soo-min's resolve is tested, her courage and compassion shining through in the face of danger.\nDay 4: Standing on the precipice of discovery, Soo-min gazes out at the moonlit village below, the cool night air stirring the leaves around her. The pieces of the puzzle begin to click into place, forming a picture of betrayal and deceit. With each revelation, Soo-min's determination solidifies, her quest for justice burning bright in her eyes. As the truth comes to light, Soo-min must confront her own fears and insecurities, standing up for what is right in the face of darkness.\nDay 5: The revelation of Hae-won's long-buried secret shatters the fragile peace between the two women, their shared past now a minefield of unspoken truths and hidden betrayals. Soo-min's resolve is tested as she grapples with the knowledge that her trust in Hae-won may have been misplaced all along. The lines between friend and foe blur as the investigation into Mae-hwa's death uncovers deeper layers of darkness that threaten to consume them both. The path forward is murky and uncertain, but Soo-min knows that she must confront the shadows of the past if she is to find the light of truth and redemption.",
    "Clue Generator": " This key clue illustrates Hae-won's internal struggle and potential involvement in the murder, adding complexity to her character.\nMisleading Clue 1: Hae-won's reclusive nature and quiet demeanor could lead others to underestimate her and dismiss her as a suspect. This misleading clue may divert attention away from her hidden motives and emotions.\nMisleading Clue 2: Hae-won's reluctance to engage with the investigation and her avoidance of certain questions may give the impression of innocence or simply a desire for privacy. This misleading clue could mask her true involvement in the events surrounding Mae-hwa's death. This misleading clue could mask Dae-hyun's personal vendetta against Mae-hwa and his potential involvement in her murder.\nMisleading Clue 2: Dae-hyun's close relationship with Hae-won's family may mislead others into believing he is solely motivated by loyalty and duty. This misleading clue could obscure Dae-hyun's darker intentions and his possible connection to the crime.Key Clue 1: Dae-hyun's hidden agenda and potential involvement in Mae-hwa's murder are hinted at through his fear of exposure and resolve to protect his image.\nKey Clue 2: Soo-min's internal turmoil and past mistake, along with her knowledge of poisons and potions, suggest a connection to Mae-hwa's death and raise suspicions about her motives.\n\nMisleading Clue 1: Dae-hyun's desperation could be seen as typical behavior for someone in his position, diverting attention from his darker intentions.\nMisleading Clue 2: Soo-min's desire to preserve healing traditions and her complex relationship with Hae-won might overshadow her potential motives and connections to the crime.",
    "Player Instruction Writer": "- Day 2: Hae-won ventures into the heart of the island, seeking inspiration in the lush forests and hidden waterfalls that whisper ancient secrets. The calls of unseen birds and rustling leaves guide her towards an abandoned temple, where a sense of foreboding lurks in the shadows.\n- Day 3: Hae-won's curiosity leads her to explore the crumbling ruins within the temple, uncovering faded murals depicting a forgotten prophecy of light and darkness. The eerie silence of the temple makes her heart race, and she senses a presence watching her every move. The weight of destiny hangs heavy in the air as Hae-won's mind races with questions.\n- Day 4: The day of reckoning dawns, and Hae-won stands at the temple's entrance, the echoes of the past urging her to unravel the mysteries that bind her fate to the island. The prophecy's whispers grow louder, foretelling a choice that will shape the island's future. As the sun sets, Hae-won knows that the truth she seeks may lead her down a path of sacrifice and redemption.\n- Day 2: The discovery of Mae-hwa's body sends shockwaves through Dae-hyun's carefully constructed world, forcing him to confront the shadows that lurk beneath the surface. As whispers of dark magic and betrayal swirl around him, Dae-hyun must tread carefully to protect his reputation and unmask the truth behind the shaman's death.\n- Day 3: Dae-hyun's interactions with Hae-won reveal a complex dynamic between them, one fueled by ambition and desire. The enigmatic healer, Soo-min, becomes a mysterious figure in his quest for power, her presence casting a spell of uncertainty over his carefully laid plans. Dae-hyun's resolve is tested as he delves deeper into the mystery of Mae-hwa's murder, unraveling threads of deception that lead him down a perilous path.\n- Day 4: Standing at the precipice of truth, Dae-hyun faces a choice that will shape the course of his future. The whispers of dark magic grow louder, threatening to consume him in a web of lies and deceit. As he grapples with the consequences of his actions, Dae-hyun must confront the shadows within himself to unlock the secrets that lie hidden in the heart of Jeju Island.- Day 2: Mae-hwa's murder shakes Soo-min to her core, the sense of loss palpable in the air around her. As she tends to the grieving family, a sense of unease settles in her heart, whispering of dark forces at play. Her intuition, honed over years of practice, warns her of impending danger, urging her to tread carefully in the shadows of deceit.\n- Day 3: Soo-min's interactions with the townspeople take on a new depth as she uncovers clues that point towards a different truth behind Mae-hwa's murder. The tendrils of suspicion stretch towards unexpected corners, challenging her to navigate the murky waters of betrayal and redemption. As she digs deeper, Soo-min finds herself entangled in a web of lies that threatens to unravel the fragile balance of her world.\n- Day 4: In the stillness of the night, Soo-min stands at the crossroads, the weight of the truth heavy on her shoulders. The whispers of the spirits echo in her ears, guiding her towards the path of righteousness. As the moon casts a silvery glow over the village, Soo-min knows that her journey is far from over, and the shadows of Mae-hwa's murder loom large on the horizon.Key Clue 2: Seo-jin's strained relationship with Mae-hwa is rooted in a deep-seated jealousy and resentment, stemming from their shared past and unresolved conflicts.This key clue hints at the possibility of Hae-won being more emotionally involved in Mae-hwa's death than initially perceived.\nMisleading Clue 1: Hae-won's seemingly aloof and detached demeanor may mislead others into underestimating her emotional depth and potential involvement in the mystery. This misleading clue could lead others to overlook her as a suspect.\nMisleading Clue 2: Hae-won's alibi of being alone in her home at the time of Mae-hwa's murder may initially divert suspicion away from her. This misleading clue could create a false sense of security around Hae-won's innocence while hiding her true motivations.This misleading clue could distract from Dae-hyun's personal motives and potential involvement in Mae-hwa's murder.\nMisleading Clue 2: Dae-hyun's stoic facade and calm demeanor may mislead others into underestimating his emotional turmoil and inner conflicts. This misleading clue could mask Dae-hyun's true feelings and the depths of his involvement in the crime.This misleading clue could distract from Soo-min's own struggles and potential motives in Mae-hwa's murder.\nOverall, Soo-min appears to be the most mysterious character, with a complex backstory and ambiguous motives that could make her a compelling suspect in Mae-hwa's murder.It's better to explore Soo-min's character and her potential motivations and connections to the mystery, rather than relying solely on a misleading clue. There may be more to her story than meets the eye, and uncovering it could lead to a deeper understanding of the overall mystery.",
    "Title": "\nPlayers must use their wits, deduction skills, and keen eye for detail to solve the mystery, unraveling clues and uncovering motives as they strive to bring the culprit to justice. Will they be able to untangle the web of lies and deceit that shrouds the mystical world of Jeju Island? Or will the truth remain buried beneath the whispers of the sea forever? Join us in this thrilling adventure where nothing is as it seems, and every choice could be a matter of life and death.",
    "Duration": "How did you find the movie?"
}